let brandBtns = document.querySelectorAll('.brandBtn')
let compStorage = JSON.parse(localStorage.getItem('compStorageData'));
let compsDiv = document.querySelector('.compsDiv')
let selectorOfBrand
let phoneNum = localStorage.getItem('user')
let imageOfLaptopInModal = document.querySelector('.modal-body img')
let paramsOfLaptop = document.querySelectorAll('.paramsDiv p')

console.log(paramsOfLaptop);

const brandData = {
  asus: [
    {"категория":"Asus","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/asus.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":998},
    {"категория":"Asus","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/asus.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":999},
    {"категория":"Asus","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/asus.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":997},
    {"категория":"Asus","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/asus.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":998},
    {"категория":"Asus","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/asus.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":999},
    {"категория":"Asus","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/asus.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":999},
    {"категория":"Asus","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/asus.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":997},
    {"категория":"Asus","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/asus.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":999},
    {"категория":"Asus","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/asus.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":997}
  ],
  
    acer: [
      {"категория":"Acer","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/acer.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":996},
      {"категория":"Acer","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/acer.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":995},
      {"категория":"Acer","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/acer.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":994},
      {"категория":"Acer","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/acer.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":996},
      {"категория":"Acer","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/acer.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":995},
      {"категория":"Acer","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/acer.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":996},
      {"категория":"Acer","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/acer.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":995},
      {"категория":"Acer","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/acer.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":996}

    ],
    dell: [
      {"категория":"Dell","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/dell.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":993},
      {"категория":"Dell","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/dell.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":992},
      {"категория":"Dell","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/dell.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":991},
      {"категория":"Dell","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/dell.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":993},
      {"категория":"Dell","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/dell.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":992},
      {"категория":"Dell","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/dell.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":991},
      {"категория":"Dell","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/dell.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":993},
      {"категория":"Dell","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/dell.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":992}
    
    ],
    
    hp: [
      {"категория":"HP","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/hp.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":990},
      {"категория":"HP","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/hp.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":989},
      {"категория":"HP","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/hp.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":990},
      {"категория":"HP","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/hp.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":989},
      {"категория":"HP","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/hp.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":990},
      {"категория":"HP","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/hp.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":989},
      {"категория":"HP","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/hp.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":990},
      {"категория":"HP","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/hp.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":989}
    ],
    
    lenovo: [
      {"категория":"Lenovo","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/lenovo.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":987},
      {"категория":"Lenovo","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/lenovo.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":986},
      {"категория":"Lenovo","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/lenovo.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":985},
      {"категория":"Lenovo","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/lenovo.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":985},
      {"категория":"Lenovo","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/lenovo.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":987},
      {"категория":"Lenovo","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/lenovo.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":986},
      {"категория":"Lenovo","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/lenovo.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":985},
      {"категория":"Lenovo","объем_оперативной_памяти":"1","название":"1","процессор":"1","цена":"1","постоянная_память":"1","описание":"1","категория_накопителя":"HDD","использование":"Да","операционная_система":"1","изображение_компьютера":"../images/lenovo.jpg","объем_оперативной_памяти":"1","идентификатор_компьютера":985}
    ],
    
};
      
    
    
compStorage.forEach(comp => {
    let brand = comp.category.toLowerCase();
    if (brandData.hasOwnProperty(brand)) {
      brandData[brand].push(comp);
    } else {
      console.log('problem');
    }
});

document.addEventListener('click', (elem) => {
    if (elem.target.classList.contains('brandBtn')) {
      let selectedBrand = elem.target.getAttribute('value');
      brandBtns.forEach(item => {
        if (item === elem.target) {
          bodyChanger(brandData[selectedBrand]);
          item.classList.remove('btn-light');
          item.classList.add('btn-primary');
        } else {
          item.classList.remove('btn-primary');
          item.classList.add('btn-light');
        }
      });
    }
});

function bodyChanger(brandStorage){
    compsDiv.innerHTML = ''
    brandStorage.forEach(elem => {
        let comp = document.createElement('div')
        comp.classList.add('comp')
        comp.setAttribute('laptopId', elem.idOfComp);
        compsDiv.append(comp)
        // image of laptop
        let laptopImage = document.createElement('img')
        laptopImage.src = elem.compimage
        laptopImage.classList.add('w-75','mb-4')
        comp.append(laptopImage)
        // paragraphs div
        let paragraphsDiv = document.createElement('div')
        paragraphsDiv.classList.add('row','align-items-left')
        comp.append(paragraphsDiv)
        // comps paragraps
        let nameParagraph = document.createElement('p')
        nameParagraph.innerText = `Имя: ${elem.category}`
        paragraphsDiv.append(nameParagraph)
        let descriptionParagraph = document.createElement('p')
        descriptionParagraph.innerText = `Описание: ${elem.description}`
        paragraphsDiv.append(descriptionParagraph)
        let price = document.createElement('p')
        price.innerText = `Цена: ${elem.cost}`
        paragraphsDiv.append(price)
        let newOrNot = document.createElement('p')
        newOrNot.innerText = `Новый: ${elem.usage}`
        paragraphsDiv.append(newOrNot)
        let phoneNumber = document.createElement('p')
        phoneNumber.innerText = `Телефон: ${JSON.parse(phoneNum).phone}`
        paragraphsDiv.append(phoneNumber)
        // details button
        let detailsButton = document.createElement('button')
        detailsButton.innerText = 'Подробно'
        detailsButton.classList.add('btn','btn-warning','w-75','mt-2','detailShowButton')
        detailsButton.setAttribute('data-bs-toggle', 'modal');
        detailsButton.setAttribute('data-bs-target', '#detailsOfLaptop');
        comp.append(detailsButton)
    })
}

document.addEventListener('click', (item) => {
  if(item.target.classList.contains('detailShowButton')){
    let laptopId = item.target.parentElement.getAttribute('laptopId');
    for (const brand in brandData) {
      const laptops = brandData[brand];
      for (const laptop of laptops) {
        if (laptop.idOfComp == laptopId) {
          updateModalWithLaptopDetails(laptop);
          break;
        }
      }
    }
  }
})

// Modal changes for each laptop
function updateModalWithLaptopDetails(laptop) {
  imageOfLaptopInModal.src = laptop.compimage;
  paramsOfLaptop[0].innerText = `Название: ${laptop.ad}`;
  paramsOfLaptop[1].innerText = `Описание: ${laptop.description}`;
  paramsOfLaptop[2].innerText = `Цена: ${laptop.cost}`;
  paramsOfLaptop[3].innerText = `Телефон: ${JSON.parse(phoneNum).phone}`;
  paramsOfLaptop[4].innerText = `Новый: ${laptop.usage}`;
  paramsOfLaptop[5].innerText = `Объем оперативной памяти: ${laptop.emeliyaddash}`;
  paramsOfLaptop[6].innerText = `Процессор: ${laptop.cpu}`;
  paramsOfLaptop[7].innerText = `Постоянная память: ${laptop.daimi}`;
  paramsOfLaptop[8].innerText = `Тип постоянной памяти: ${laptop.romcategory}`;
  paramsOfLaptop[9].innerText = `Операционная система: ${laptop.os}`;
  paramsOfLaptop[10].innerText = `Видеокарта: ${laptop.ram}`;
  
}